In [2]:
import pandas as pd

In [2]:
#Создадим первый датафрэйм
s1 = pd.Series(['Ivan','Andrey','Igor'])

In [11]:
#Для того, чтобы наша серия стала ДатаФрэймом необходимо серии назначить имя
#Имя колонки
s1.name = 'user_names'

In [12]:
df = pd.DataFrame(s1)
df

  user_names
0       Ivan
1     Andrey
2       Igor

In [15]:
#Теперь получим нашу колонку обратно и получим данные из нее
df['user_names']

0      Ivan
1    Andrey
2      Igor
Name: user_names, dtype: object

In [16]:
s1 = df['user_names']

In [17]:
s1.values

array(['Ivan', 'Andrey', 'Igor'], dtype=object)

In [18]:
s1.index

RangeIndex(start=0, stop=3, step=1)

In [19]:
s1.name

'user_names'

#### Важное дополнение по поводу индексации
В словаре не может быть у одного ключа двух разных значений
В серии же один ключ может содержать два значения

In [23]:
d = {'a':1, 'b':2, 'c':3,'d':4}
d

{'a': 1, 'b': 2, 'c': 3, 'd': 4}

In [26]:
#В Серии есть разные значения под одним индексом
s1 = pd.Series([1, 2, 3], index= ['a', 'b', 'a'])
s1

a    1
b    2
a    3
dtype: int64

In [27]:
#Поробуем обратится по индексу a
s1['a']

a    1
a    3
dtype: int64

#### Создадим датафрэйм

In [29]:
data = {'city' : ['Moscow','Moscow','Moscow','Kazan','Kazan','Kazan'],
       'year' : ['2022','2021','2020','2022','2021','2020'],
       'visits' : [500, 2000, 1500, 100, 230, 200]}
data

{'city': ['Moscow', 'Moscow', 'Moscow', 'Kazan', 'Kazan', 'Kazan'],
 'year': ['2022', '2021', '2020', '2022', '2021', '2020'],
 'visits': [500, 2000, 1500, 100, 230, 200]}

In [31]:
df = pd.DataFrame(data)
df

     city  year  visits
0  Moscow  2022     500
1  Moscow  2021    2000
2  Moscow  2020    1500
3   Kazan  2022     100
4   Kazan  2021     230
5   Kazan  2020     200

In [32]:
#Получим первые значения

In [33]:
df.head(4)

     city  year  visits
0  Moscow  2022     500
1  Moscow  2021    2000
2  Moscow  2020    1500
3   Kazan  2022     100

In [35]:
#Чтобы поправить последовательность колонок необходимо сделать следующее
df2 = pd.DataFrame(data, columns=['visits', 'ciy', 'year'])
df2

   visits  ciy  year
0     500  NaN  2022
1    2000  NaN  2021
2    1500  NaN  2020
3     100  NaN  2022
4     230  NaN  2021
5     200  NaN  2020

In [36]:
#Допустим мы добавим колонку, которой нет
df2 = pd.DataFrame(data, columns=['visits', 'ciy', 'year1'])
df2

   visits  ciy year1
0     500  NaN   NaN
1    2000  NaN   NaN
2    1500  NaN   NaN
3     100  NaN   NaN
4     230  NaN   NaN
5     200  NaN   NaN

In [38]:
#При создании датафрейма вы можете задать свои собственные индексы (как и с серией)
df3 = pd.DataFrame(data, index=['a', 'b', 'c', 'd', 'e', 'f'])
df3

     city  year  visits
a  Moscow  2022     500
b  Moscow  2021    2000
c  Moscow  2020    1500
d   Kazan  2022     100
e   Kazan  2021     230
f   Kazan  2020     200

In [40]:
#К колонкам лучше обращаться именно так
df3['city']

a    Moscow
b    Moscow
c    Moscow
d     Kazan
e     Kazan
f     Kazan
Name: city, dtype: object

In [42]:
#Есть конечно еще такой способ, но если у нас будет в названии пробел, это не будет работать
df3.city

a    Moscow
b    Moscow
c    Moscow
d     Kazan
e     Kazan
f     Kazan
Name: city, dtype: object

In [43]:
data2 = {'city' : ['Moscow','Moscow','Moscow','Kazan','Kazan','Kazan'],
       'year' : ['2022','2021','2020','2022','2021','2020'],
       'visits v' : [500, 2000, 1500, 100, 230, 200]}
data2

{'city': ['Moscow', 'Moscow', 'Moscow', 'Kazan', 'Kazan', 'Kazan'],
 'year': ['2022', '2021', '2020', '2022', '2021', '2020'],
 'visits v': [500, 2000, 1500, 100, 230, 200]}

In [45]:
df4 = pd.DataFrame(data2, index=['a', 'b', 'c', 'd', 'e', 'f'])
df4

     city  year  visits v
a  Moscow  2022       500
b  Moscow  2021      2000
c  Moscow  2020      1500
d   Kazan  2022       100
e   Kazan  2021       230
f   Kazan  2020       200

In [46]:
#Не работает
df4.visits v

SyntaxError: invalid syntax (3463690094.py, line 1)

In [48]:
#Работает
df4['visits v']

a     500
b    2000
c    1500
d     100
e     230
f     200
Name: visits v, dtype: int64

In [52]:
df4

     city  year  visits v
a  Moscow  2022       500
b  Moscow  2021      2000
c  Moscow  2020      1500
d   Kazan  2022       100
e   Kazan  2021       230
f   Kazan  2020       200

In [55]:
#Чтобы получить строку необходимо использовать loc
#Важно запомнить, чот мы получим серию
df4.loc['c']

city        Moscow
year          2020
visits v      1500
Name: c, dtype: object

In [56]:
#Я хочу заполнить значения столбцов
df['visits'] = 0
df

     city  year  visits
0  Moscow  2022       0
1  Moscow  2021       0
2  Moscow  2020       0
3   Kazan  2022       0
4   Kazan  2021       0
5   Kazan  2020       0

In [57]:
#Или
df['visits'] = [1,2,3,4,5,6]
df

     city  year  visits
0  Moscow  2022       1
1  Moscow  2021       2
2  Moscow  2020       3
3   Kazan  2022       4
4   Kazan  2021       5
5   Kazan  2020       6

In [59]:
#Создадим новую колонку
df['visits2'] = [1,2,3,4,5,6]
df

     city  year  visits  visits2
0  Moscow  2022       1        1
1  Moscow  2021       2        2
2  Moscow  2020       3        3
3   Kazan  2022       4        4
4   Kazan  2021       5        5
5   Kazan  2020       6        6

In [62]:
#Очень важно, чтобы количество элементов совпадало, иначе мы получим ошибку
df['nextyear'] = [1,3,5]
df

ValueError: Length of values (3) does not match length of index (6)

In [65]:
#ValueError: Length of values (3) does not match length of index (6)

In [69]:
#Серию просто так тоже не добавить, необходимо задать индексы
s = pd.Series([1,15,64], index = [0, 2, 5])
s

0     1
2    15
5    64
dtype: int64

In [70]:
df['nextyear'] = s
df

     city  year  visits  visits2  nextyear
0  Moscow  2022       1        1       1.0
1  Moscow  2021       2        2       NaN
2  Moscow  2020       3        3      15.0
3   Kazan  2022       4        4       NaN
4   Kazan  2021       5        5       NaN
5   Kazan  2020       6        6      64.0

Step_3.5.11 - На основе словаря создайте датафрейм с индексами user1, user2, user3, user4

In [11]:
import pandas as pd

def solution():
    data = {'user' : ['Ivan', 'Petr', 'Nikolay', 'Andrey'], 
            'time_per_page' :  [10, 30 , 15, 5], 
             'pages' : [7, 9, 12, 3]}
    result = pd.DataFrame(data, index = ['user1', 'user2', 'user3', 'user4'])
    return result

In [12]:
solution()

          user  time_per_page  pages
user1     Ivan             10      7
user2     Petr             30      9
user3  Nikolay             15     12
user4   Andrey              5      3

Step_3.5.12 - На вход функции подаётся датафрейм с прошлого степа. Добавьте в датафрейм новую колонку с названием total_time, и присвойте ей произведение значений из столбцов time_per_page и pages. Функция должна вернуть итоговый датафрейм.

In [13]:
df_s = solution()
df_s

          user  time_per_page  pages
user1     Ivan             10      7
user2     Petr             30      9
user3  Nikolay             15     12
user4   Andrey              5      3

In [26]:
import pandas as pd

def solution_2(df_s):
    df_s['total_time'] =  df_s['time_per_page'] * df_s['pages']
    return df_s

In [27]:
solution_2(df_s)

          user  time_per_page  pages  is_correct  total_time
user1     Ivan             10      7           0          70
user2     Petr             30      9           0         270
user3  Nikolay             15     12           0         180
user4   Andrey              5      3           0          15

Step_3.5.13 - На вход функции подаётся датафрейм с прошлого степа и серия, которая содержит информацию о балансе пользователя: 
![Картинка испарилась(((](https://ucarecdn.com/7fa011bf-a2bb-4f9d-a6d3-ebed9dc47bdb/)
добавьте в датафрейм столбец balance, который будет хранить информацию о балансе из серии.

In [28]:
import pandas as pd

s1 = pd.Series([200,150], index=['user3', 'user4'])

def solution(df_s, s1):
    df_s['balance'] = s1
    return df_s

In [29]:
solution(df_s, s1)

          user  time_per_page  pages  is_correct  total_time  balance
user1     Ivan             10      7           0          70      NaN
user2     Petr             30      9           0         270      NaN
user3  Nikolay             15     12           0         180    200.0
user4   Andrey              5      3           0          15    150.0

Step_3.5.14 - На вход функции подаётся датафрейм с прошлого степа. Найдите индексы строк, где баланс не подтянулся. На выходе функция должна вернуть объект Index

In [30]:
import pandas as pd

def solution3(df_s):
    mask = pd.isna(df_s['balance'])
    result = df_s['balance'][mask].index.values
    return result

In [31]:
solution3(df_s)

array(['user1', 'user2'], dtype=object)

In [32]:
#Решение полаконичнее
import pandas as pd

def solution(df):
    result = df[df['balance'].isnull()].index
    return result

Step_3.5.15 - На вход функции подаётся датафрейм с прошлого степа. Создайте новую колонку c названием is_correct. Проверьте каждое значение из столбца total_time. Если значение меньше 100, то в колонку is_correct вставьте True, а иначе False. Функция должна вернуть датафрейм с внесёнными изменениями.

In [33]:
import pandas as pd
import numpy as np

def solution4(df_s):
    df_s['is_correct'] = np.where(df_s['total_time'] < 100, True, False)
    return df_s

In [34]:
solution4(df_s)

          user  time_per_page  pages  is_correct  total_time  balance
user1     Ivan             10      7        True          70      NaN
user2     Petr             30      9       False         270      NaN
user3  Nikolay             15     12       False         180    200.0
user4   Andrey              5      3        True          15    150.0

In [35]:
#лаконичное четкое решение
import pandas as pd

def solution(df):
    df['is_correct'] = df['total_time'] < 100
    return df

# Step_3.6

- Если вы добавляете серию к датафрейму, то будьте внимательны с индексами! Если у серии будут индексы, которых нет у датафрейма, то значения из серии просто не добавятся к датафрейму!

In [38]:
data = { 'city': ['Moscow', 'Moscow', 'Moscow', 'Kazan', 'Kazan', 'Kazan'],
        'year':  [2022,      2021,     2020,     2022,    2021,    2020],
        'visits': [1,      2,     3,     4,     5,     6]}
# Изменение порядка столбцов в ДатаФрейме
df = pd.DataFrame(data, columns=['city', 'year', 'visits'])
s1 = pd.Series([1, 10, 20], index=[0, 3, 5]) # Значения и их индексы
df['old_visits'] = s1 # Благодаря тому, что индексы указаны, значения будут добавлены только по ним

df

     city  year  visits  old_visits
0  Moscow  2022       1         1.0
1  Moscow  2021       2         NaN
2  Moscow  2020       3         NaN
3   Kazan  2022       4        10.0
4   Kazan  2021       5         NaN
5   Kazan  2020       6        20.0

In [40]:
#еще один способ положить значния в столбец
#Любой одномерный массив может быть положен в колонку
import numpy as np
df['old_visits'] = np.arange(6)
df

     city  year  visits  old_visits
0  Moscow  2022       1           0
1  Moscow  2021       2           1
2  Moscow  2020       3           2
3   Kazan  2022       4           3
4   Kazan  2021       5           4
5   Kazan  2020       6           5

In [48]:
#Обращаю внимание на то. что вот таким образом новую колонку создать не удастся
df.old_visits_2 = np.arange(6)
df

     city  year  visits  old_visits
0  Moscow  2022       1           0
1  Moscow  2021       2           1
2  Moscow  2020       3           2
3   Kazan  2022       4           3
4   Kazan  2021       5           4
5   Kazan  2020       6           5

In [50]:
df['old_visits_2'] = np.arange(6)
df

     city  year  visits  old_visits  old_visits_2
0  Moscow  2022       1           0             0
1  Moscow  2021       2           1             1
2  Moscow  2020       3           2             2
3   Kazan  2022       4           3             3
4   Kazan  2021       5           4             4
5   Kazan  2020       6           5             5

In [52]:
#Удаление колонки
del df['old_visits_2']
df

     city  year  visits  old_visits
0  Moscow  2022       1           0
1  Moscow  2021       2           1
2  Moscow  2020       3           2
3   Kazan  2022       4           3
4   Kazan  2021       5           4
5   Kazan  2020       6           5

- Еще о создании DataFrame

In [54]:
data = {'city' : ['Moscow','Moscow','Moscow','Kazan','Kazan','Kazan'],
       'year' : ['2022','2021','2020','2022','2021','2020'],
       'visits' : [500, 2000, 1500, 100, 230, 200]}

In [55]:
data2 = {'Moscow' : {2020:1500, 2021:2020, 2022:500},
        'Kazan' : {2020:200, 2021:230, 2022:100}}

In [56]:
df = pd.DataFrame(data)
df

     city  year  visits
0  Moscow  2022     500
1  Moscow  2021    2000
2  Moscow  2020    1500
3   Kazan  2022     100
4   Kazan  2021     230
5   Kazan  2020     200

In [59]:
#В общем то данные у нас все те же. но в данном случаем года идут в индексы(ключи)
df2 = pd.DataFrame(data2)
df2

      Moscow  Kazan
2020    1500    200
2021    2020    230
2022     500    100

- Транспонирование

In [60]:
df2.T

        2020  2021  2022
Moscow  1500  2020   500
Kazan    200   230   100

- Создание индексов

In [64]:
#Пандас ругаться не будет, он просто создаст строку с NaN
df2 = pd.DataFrame(data2, index=[2020,2022,2023])
df2

      Moscow  Kazan
2020  1500.0  200.0
2022   500.0  100.0
2023     NaN    NaN

- Свойство Values у DataFrame

In [67]:
#Вспомни как было у серий
s1 = pd.Series([1,2,3,4])
s1.values

array([1, 2, 3, 4], dtype=int64)

In [69]:
#Получаем двумерный массив Numpy
#Тип данных он будет выводить. который наиболее подходит
df.values

array([['Moscow', '2022', 500],
       ['Moscow', '2021', 2000],
       ['Moscow', '2020', 1500],
       ['Kazan', '2022', 100],
       ['Kazan', '2021', 230],
       ['Kazan', '2020', 200]], dtype=object)

- Поговорим про индексы

In [70]:
#Создаем серию
s1 = pd.Series([1,2,3], index = ['a','b','c'])
s1

a    1
b    2
c    3
dtype: int64

In [73]:
#Получим индексы и присвоим их
index = s1.index
index

Index(['a', 'b', 'c'], dtype='object')

In [75]:
#Получим часть индексов слайсингом
index[1:]

Index(['b', 'c'], dtype='object')

In [106]:
#А что, если мы хотим переписать индекс
#Мы получим ошибку. Этот индекс не поддерживает перезапись таким образом
#Мы должны именно положить новый список индексов
index[1] = 'G'

TypeError: Index does not support mutable operations

In [82]:
#Создадим индекс
labels = pd.Index(['A','B','C'])
labels

Index(['A', 'B', 'C'], dtype='object')

In [85]:
#Мы можем проверить наличие индекса
#Обнаружим, что он чувствителен к регистру
'a' in labels, 'A' in labels

(False, True)

In [86]:
#Создадим серию, воспользовавшись нашими индексами
s2 = pd.Series([1,2,3], index = labels)
s2

A    1
B    2
C    3
dtype: int64

Step_3.6.11 - На вход подаётся датафрейм. Удалите столбец clicks:
![Картинка испарилась(((](https://ucarecdn.com/8ab4cc8d-302c-4735-89fb-63ef2520e977/)
функция должна вернуть итоговый датафрейм.

In [126]:
data3 = {'user_name':['Ivan','Alex', 'Ugen'],
        'clicks':[2,5,8],
        'time_interval':[3,6,9]}
data3

{'user_name': ['Ivan', 'Alex', 'Ugen'],
 'clicks': [2, 5, 8],
 'time_interval': [3, 6, 9]}

In [127]:
_df = pd.DataFrame(data3)
_df

  user_name  clicks  time_interval
0      Ivan       2              3
1      Alex       5              6
2      Ugen       8              9

In [95]:
import pandas as pd

def solution(_df):
    del _df['clicks']
    result = _df
    return result

In [96]:
solution(_df)

  user_name  time_interval
0      Ivan              3
1      Alex              6
2      Ugen              9

Step_3.6.12 - На вход подаётся датафрейм.
![Картинка испарилась(((](https://ucarecdn.com/79075c75-c697-4006-b19a-1b09b43eeba1/)
отредактируйте индекс второй строки:
![Картинка испарилась(((](https://ucarecdn.com/251cf53c-9d7f-4914-ac16-00c8059b1124/)                        
(замените 1 на one)
Функция должна вернуть отредактированный датафрейм.

In [104]:
import pandas as pd

def solution(_df):
    _df.index = [0, 'one', 2]
    return _df

In [105]:
 solution(_df)

    user_name  clicks  time_interval
0        Ivan       2              3
one      Alex       5              6
2        Ugen       8              9

Step_3.6.12 - На вход подаётся датафрейм.
![Картинка испарилась(((](https://ucarecdn.com/79075c75-c697-4006-b19a-1b09b43eeba1/)
переведите название (лейблы) колонок в верхний регистр:
![Картинка испарилась(((](https://ucarecdn.com/46a2fb3b-d728-4b79-8f08-bdafd0545ece/)                   Функция должна вернуть отредактированный датафрейм.

In [119]:
import pandas as pd

def solution(_df):
    _df.columns = _df.columns.str.upper()
    return _df

In [121]:
solution(_df)

  USER_NAME  CLICKS  TIME_INTERVAL
0      Ivan       2              3
1      Alex       5              6
2      Ugen       8              9

Step_3.6.13 - На вход функции подаётся некоторый датафрейм. Определите количество строк и количество столбцов в датафрейме. Функция должна вернуть кортеж: (количество строк, количество столбцов)
Первый способ (костыльный):
получить от датафрейма индексы строк и столбцов. Воспользоваться функцией len и построить кортеж:
(len(df.....), len(df....))
Второй способ (получше):
Вспомнить как мы определяли размеры массива в numpy. Что это было за свойство? Попробовать запросить это свойство у датафрейма)

In [122]:
import pandas as pd

def solution(_df):
    return _df.shape

In [124]:
solution(_df)

(3, 3)

Step_3.6.12 - В функцию поступает уже известный нам датафрейм:
![Картинка испарилась(((](https://ucarecdn.com/cc9f95c0-7200-4e9f-b441-64e53a40470f/)
и серия, которая хранит в себе значения для столбца balance (который вам надо добавить):
![Картинка испарилась(((](https://ucarecdn.com/03f7de5b-5d68-457c-a5fd-e70fc719bf1b/)                   Вы выполняете команду по добавлению серии в столбец balance:
![Картинка испарилась(((](https://ucarecdn.com/d57d9101-23b7-4e1c-9f88-7f269e0c71e5/)
Но на выходе вы получаете не то, что ожидали:
![Картинка испарилась(((](https://ucarecdn.com/d02a7966-392b-4670-9821-dd344ad6d5c1/)
По началу вы ничего не поняли, но потом решили проверить тип данных индексов:
![Картинка испарилась(((](https://ucarecdn.com/a48dacf8-60b9-42ef-a645-0c1ad57713e2/)
Доработайте серию таким образом чтобы команда
![Картинка испарилась(((](https://ucarecdn.com/d57d9101-23b7-4e1c-9f88-7f269e0c71e5/)
выполнилась корректно:
![Картинка испарилась(((](https://ucarecdn.com/2937f5c5-32df-4d41-9226-0df684f9ace5/)

In [208]:
_df
_s1 = pd.Series([100,200,800], index = ['0','1','2'])
_s1.index

Index(['0', '1', '2'], dtype='object')

In [207]:
_s1.index = _s1.index.astype('Int64')
_s1.index.values

<IntegerArray>
[0, 1, 2]
Length: 3, dtype: Int64

In [209]:
import pandas as pd

def solution(_df, _s1):
    _s1.index = _s1.index.astype('Int64')
    _df['balance'] = _s1
    return _df

In [210]:
solution(_df, _s1)

  user_name  clicks  time_interval  balance
0      Ivan       2              3      100
1      Alex       5              6      200
2      Ugen       8              9      800